{
  "common": {
    "skipToContent": "Skip to main content",
    "home": "Home",
    "about": "About",
    "blog": "Blog",
    "terms": "Terms & Privacy",
    "contact": "Contact",
    "readMore": "Read More",
    "minRead": "min read",
    "loading": "Loading...",
    "error": "Error",
    "back": "Back",
    "siteName": "Web3 Learn",
    "mainNavigation": "Main navigation"
  },
  "home": {
    "title": "Learn Bitcoin & Web3, Made Simple",
    "subtitle": "Understanding Bitcoin and Web3 doesn't have to be complicated. We break down complex concepts into simple, easy-to-understand lessons perfect for absolute beginners.",
    "startLearning": "Start Learning",
    "learnMore": "Learn More",
    "whatYoullLearn": "What You'll Learn",
    "whatYoullLearnDesc": "Our lessons cover everything from the basics of Bitcoin to understanding the broader Web3 ecosystem.",
    "bitcoinBasics": "Bitcoin Basics",
    "bitcoinBasicsDesc": "Learn what Bitcoin is, how it works, and why it matters in simple terms.",
    "blockchainExplained": "Blockchain Explained",
    "blockchainExplainedDesc": "Understand the technology behind Bitcoin and how blockchains work.",
    "web3Fundamentals": "Web3 Fundamentals",
    "web3FundamentalsDesc": "Explore the decentralized web and how it differs from the internet you know.",
    "digitalWallets": "Digital Wallets",
    "digitalWalletsDesc": "Learn about digital wallets and how to safely store cryptocurrency.",
    "smartContracts": "Smart Contracts",
    "smartContractsDesc": "Discover how smart contracts work and their real-world applications.",
    "decentralization": "Decentralization",
    "decentralizationDesc": "Understand what decentralization means and why it matters.",
    "howItWorks": "How It Works",
    "howItWorksDesc": "Our learning journey is designed to be simple and accessible.",
    "step1": "Start with the Basics",
    "step1Desc": "We begin with fundamental concepts, assuming you have zero prior knowledge of Bitcoin or Web3.",
    "step2": "Learn Through Stories",
    "step2Desc": "Complex ideas are explained using simple analogies, visual diagrams, and real-world examples.",
    "step3": "Build Your Understanding",
    "step3Desc": "Each lesson builds on the previous one, gradually expanding your knowledge of the Web3 world.",
    "step4": "Practice & Explore",
    "step4Desc": "Apply what you learn and explore further resources to deepen your understanding.",
    "readyToStart": "Ready to Start Learning?",
    "readyToStartDesc": "Begin your journey into Bitcoin and Web3 with our first lesson, designed specifically for beginners.",
    "exploreBlog": "Explore Our Blog"
  },
  "about": {
    "title": "About Web3 Learn",
    "subtitle": "Making Bitcoin and Web3 education accessible to everyone, one simple explanation at a time.",
    "mission": "Our Mission",
    "missionText1": "Bitcoin and Web3 technologies represent one of the most significant innovations of our time. However, the complexity of these concepts often creates barriers that prevent people from understanding and participating in this new digital economy.",
    "missionText2": "Our mission is to break down these barriers by providing clear, simple, and accessible educational content. We believe that everyone, regardless of their technical background or prior knowledge, should have the opportunity to understand Bitcoin and Web3.",
    "missionText3": "Whether you're a complete beginner, a student, or someone simply curious about these technologies, we're here to guide you on your learning journey.",
    "philosophy": "Our Educational Philosophy",
    "simplicityFirst": "Simplicity First",
    "simplicityFirstDesc": "We believe that complex concepts can be explained simply without losing their essence. Every lesson is designed to be understood by someone with zero prior knowledge.",
    "visualLearning": "Visual Learning",
    "visualLearningDesc": "We use diagrams, illustrations, and visual metaphors to help you understand abstract concepts. A picture is worth a thousand words, especially when learning something new.",
    "accessibilityForAll": "Accessibility for All",
    "accessibilityForAllDesc": "Our content is designed to be accessible to everyone, including those using assistive technologies. We follow WCAG guidelines to ensure our website is usable by all learners.",
    "noJargon": "No Jargon Without Explanation",
    "noJargonDesc": "We avoid technical jargon whenever possible. When we must use technical terms, we explain them immediately in simple language.",
    "whatMakesDifferent": "What Makes This Different",
    "whatMakesDifferentText1": "Many resources about Bitcoin and Web3 assume you already have a background in computer science, cryptography, or economics. We don't.",
    "whatMakesDifferentText2": "Our content is specifically designed for absolute beginners. We start from the very beginning, using analogies and simple language to explain concepts that might seem intimidating elsewhere.",
    "whatMakesDifferentText3": "We're committed to creating an inclusive learning environment where everyone feels welcome, regardless of their age, technical background, or prior knowledge.",
    "readyToStart": "Ready to Start Learning?",
    "readyToStartDesc": "Begin your journey with our beginner-friendly blog posts designed to make Bitcoin and Web3 concepts easy to understand.",
    "exploreBlog": "Explore Our Blog"
  },
  "blog": {
    "title": "Learn Bitcoin & Web3",
    "subtitle": "Simple, beginner-friendly explanations of complex concepts.",
    "noPosts": "No blog posts yet. Check back soon!",
    "postNotFound": "Post Not Found",
    "postNotFoundDesc": "The blog post you're looking for doesn't exist or has been moved.",
    "backToBlog": "Back to Blog"
  },
  "terms": {
    "title": "Terms & Privacy Policy",
    "lastUpdated": "Last updated",
    "termsOfUse": "Terms of Use",
    "acceptanceOfTerms": "Acceptance of Terms",
    "acceptanceOfTermsText": "By accessing and using this website, you accept and agree to be bound by the terms and provision of this agreement.",
    "educationalContent": "Educational Content",
    "educationalContentText": "The content on this website is provided for educational purposes only. While we strive to provide accurate information, we make no representations or warranties of any kind, express or implied, about the completeness, accuracy, reliability, or suitability of the information.",
    "notFinancialAdvice": "Not Financial Advice",
    "notFinancialAdviceText": "The information on this website does not constitute financial, investment, or trading advice. We are not financial advisors, and you should consult with a qualified financial professional before making any financial decisions.",
    "intellectualProperty": "Intellectual Property",
    "intellectualPropertyText": "All content on this website, including text, graphics, logos, and images, is the property of Web3 Learn or its content suppliers and is protected by copyright and other intellectual property laws.",
    "privacyPolicy": "Privacy Policy",
    "informationWeCollect": "Information We Collect",
    "informationWeCollectText": "We are committed to protecting your privacy. Currently, we do not collect personal information unless you voluntarily provide it to us. If we add features that require data collection in the future, we will update this policy accordingly.",
    "cookiesAndTracking": "Cookies and Tracking",
    "cookiesAndTrackingText": "This website may use cookies to enhance your browsing experience. You can choose to disable cookies through your browser settings, though this may affect site functionality.",
    "thirdPartyServices": "Third-Party Services",
    "thirdPartyServicesText": "We may use third-party services for analytics or other purposes. These services have their own privacy policies governing the use of your information.",
    "yourRights": "Your Rights",
    "yourRightsText": "You have the right to access, update, or delete any personal information we may hold about you. If you have questions about your privacy rights, please contact us.",
    "contactInformation": "Contact Information",
    "contactInformationText": "If you have any questions about these Terms & Privacy Policy, please contact us through our website."
  },
  "footer": {
    "brand": "Web3 Learn",
    "tagline": "Making Bitcoin and Web3 education accessible to everyone.",
    "quickLinks": "Quick Links",
    "legal": "Legal",
    "copyright": "All rights reserved."
  }
}

